<script>
import Swiper from "swiper"
import "swiper/swiper-bundle.css"

export default {
  name: "TourPage",
  components: {
    Swiper,
  },
  data() {
    return {
      swp: null,
      skills: [
        {
          title: "ПЛЯЖ",
          list: [
            "собственный песчаный пляж находится рядом с отелем, вниз по склону",
            "курсирует шаттл на пляж",
            "шезлонги, зонтики, пляжные полотенца - бесплатно",
          ],
        },
        {
          title: "ТЕРРИТОРИЯ ОТЕЛЯ",
          list: [
            "открытый бассейн",
            "бассейн с 2 горками",
            "основной ресторан",
            "аля карт ресторан",
            "7 баров (диско-бар и витамин-бар платно)",
            "амфитеатр",
          ],
        },
        {
          title: "БЕСПЛАТНЫЕ УСЛУГИ",
          list: ["хаммам, сауна"],
        },
        {
          title: "ПЛАТНЫЕ УСЛУГИ",
          list: ["массаж, пилинг", "водные виды спорта", "Wi-Fi"],
        },
        {
          title: "УСЛУГИ",
          list: [
            "тренажерный зал",
            "аэробика",
            "настольный теннис",
            "теннис (освещение платно)",
            "баскетбол",
            "дартс, бочча",
            "СПА-центр",
            "вызов врача",
            "прокат автомобиля",
            "прачечная",
            "конференц-зал",
          ],
        },
        {
          title: "РАЗВЛЕЧЕНИЯ В ОТЕЛЕ",
          list: ["дискотека (напитки платно)", "анимация"],
        },
        {
          title: "ДЛЯ ДЕТЕЙ",
          list: [
            "2 открытых бассейна по 40 кв.м",
            "1 водная горка",
            "анимация на русском языке",
            "стульчики в ресторане",
            "кроватка, по запросу",
            "мини-клуб (4-13 лет)",
            "игровая площадка",
            "мини-диско",
            "няня, платно",
          ],
        },
        {
          title: "ПИТАНИЕ",
          list: ["UAI — ультра все включено 24 часа"],
        },
        {
          title: "КОНЦУПЦИЯ ПИТАНИЯ",
          list: [
            "В концепцию входит: завтрак, поздний завтрак, обед и ужин — шведский стол, закуски, выпечка и сладости в определенные часы, ночной суп, местные и некоторые импортные алкогольные и безалкогольные напитки.",
            "Аля карт ресторан — при проживании от 7 дней одно бесплатное посещение, по резервации.",
            "Кальян, витамин-бар, импортные алкогольные напитки не включенные в концепцию, свежевыжатый сок, напитки на дискотеке, напитки в бутылках - платно.",
          ],
        },
        {
          title: "В НОМЕРЕ",
          list: [
            "сейф (платно)",
            "душ",
            "банные принадлежности",
            "ТВ",
            "мини-бар (безалкогольные напитки в день заезда, далее только вода ежедневно)",
            "фен",
            "сплит-кондиционер",
            "Wi-Fi (платно)",
            "телефон",
            "софа",
            "напольное покрытие: керамическая плитка",
            "уборка номера: ежедневно",
            "смена белья: 2 раза в неделю",
            "смена полотенец: ежедневно",
          ],
        },
        {
          title: "ТИПЫ НОМЕРОВ",
          list: [
            "Family Room: 42 кв. м, 2 спальни с дверью, 1 ванная комната, балкон, макс. 4+1 чел.",
            "Standard Room: 30 кв. м, балкон, вид на сад/бассейн, макс. 3+1 чел.",
            "Economy Room: такие же характеристики, как у номера Стандарт, без вида.",
          ],
        },
        {
          title: "ПРИМЕЧАНИЕ:",
          list: [
            "Администрация отеля оставляет за собой право вносить любые изменения в концепцию отеля, в том числе о наборе платных/бесплатных услуг без предварительного уведомления. Мы просим предварительно уточнять интересующую Вас информацию.",
          ],
        },
      ],
    }
  },
  mounted() {
    this.swp = new Swiper(".swiper", {
      slidesPerView: 1,
      spaceBetween: 0,
      loop: true,
    })
    let swp2 = this.swp
    this.swp.on("slideChange", function () {
      document.querySelector(".swpFraction").textContent =
        `${swp2.activeIndex + 1}/${swp2.slides.length + 1}`
    })
  },
  created() {
    window.scrollTo(0, 0)
  },
}
</script>

<template>
  <div class="absolute top-0 -z-[1] h-full w-full bg-white ring"></div>
  <Container>
    <div class="font-roboto bg-white">
      <router-link
        class="leadin-[18px] mb-[20px] block text-[16px] font-medium italic text-[#686868]"
        to="/">
        <span class="text-[#686868]"> Вернуться к поиску </span>
      </router-link>
      <div
        class="rounded-[10px] bg-[#1EC0CA] pb-[20px] pl-[25px] pr-[31px] pt-[28px]">
        <div class="flex items-center gap-[3px]">
          <svg
            v-for="i in 5"
            :key="i"
            fill="none"
            height="13"
            viewBox="0 0 14 13"
            width="14"
            xmlns="http://www.w3.org/2000/svg">
            <path
              d="M13.5078 5.33044C13.5078 5.38513 13.4896 5.44438 13.4531 5.50818C13.4167 5.57198 13.362 5.64034 13.2891 5.71326L10.4727 8.47498L11.1289 12.3851C11.1289 12.3942 11.1289 12.4125 11.1289 12.4398C11.1289 12.4672 11.1289 12.4945 11.1289 12.5219C11.1289 12.5765 11.1221 12.6289 11.1084 12.6791C11.0947 12.7292 11.0742 12.7679 11.0469 12.7953C11.0195 12.8317 10.9899 12.8636 10.958 12.891C10.9261 12.9183 10.8828 12.932 10.8281 12.932C10.7734 12.932 10.7188 12.9206 10.6641 12.8978C10.6094 12.875 10.5547 12.85 10.5 12.8226L7 10.9906L3.5 12.8226C3.44531 12.85 3.39062 12.875 3.33594 12.8978C3.28125 12.9206 3.22656 12.932 3.17188 12.932C3.11719 12.932 3.06934 12.9206 3.02832 12.8978C2.9873 12.875 2.95312 12.8409 2.92578 12.7953C2.89844 12.7679 2.87793 12.7292 2.86426 12.6791C2.85059 12.6289 2.84375 12.5765 2.84375 12.5219C2.84375 12.5127 2.84375 12.4945 2.84375 12.4672C2.84375 12.4398 2.85286 12.4125 2.87109 12.3851L3.52734 8.47498L0.683594 5.71326C0.628906 5.63123 0.583333 5.56059 0.546875 5.50134C0.510417 5.4421 0.492188 5.38513 0.492188 5.33044C0.492188 5.2393 0.530924 5.16182 0.608398 5.09802C0.685872 5.03422 0.792969 4.9932 0.929688 4.97498L4.86719 4.40076L6.61719 0.846069C6.67188 0.736694 6.72884 0.654663 6.78809 0.599976C6.84733 0.545288 6.91797 0.517944 7 0.517944C7.08203 0.517944 7.15267 0.545288 7.21191 0.599976C7.27116 0.654663 7.32812 0.736694 7.38281 0.846069L9.13281 4.40076L13.0703 4.97498C13.207 4.98409 13.3141 5.02055 13.3916 5.08435C13.4691 5.14815 13.5078 5.23018 13.5078 5.33044Z"
              fill="#FFCC00" />
          </svg>
        </div>
        <h2 class="my-[12px] text-[26px] font-extrabold text-white">
          senza garden holiday club (ex. larissa hill beach) 5*
        </h2>
        <p class="mb-[24px] text-[14px] font-normal leading-[18px] text-white">
          Турция, Аланья
        </p>
        <div
          class="flex flex-col items-stretch overflow-hidden rounded-[10px] bg-white lg:flex-row">
          <div
            class="lg:pe-40px w-full p-[13px] lg:pb-[13px] lg:pe-0 lg:pl-[23px] lg:pt-[24px]">
            <ul
              class="mb-[25px] flex flex-wrap items-start gap-x-[12px] gap-y-[12px] text-[#333333] md:gap-x-[40px]">
              <li
                class="flex w-full items-center gap-[27px] md:w-[calc(50%_-_20px)] xl:w-[147px]">
                <img
                  alt=""
                  class="shrink-0"
                  src="@/assets/images/tour-icon-1.svg" />
                <div class="flex flex-col gap-[6px] text-[16px] leading-[18px]">
                  <h4 class="font-[700]">Турция</h4>
                  <p class="font-[400] text-[#777777]">из Алматы</p>
                </div>
              </li>
              <li
                class="flex w-full items-start gap-[27px] md:w-[calc(50%_-_20px)] xl:w-[360px]">
                <img
                  alt=""
                  class="shrink-0"
                  src="@/assets/images/tour-icon-2.svg" />
                <div class="flex flex-col gap-[6px] text-[16px] leading-[18px]">
                  <h4 class="font-[700]">Питание</h4>
                  <p class="font-[400] text-[#777777]">
                    UAI - Ультра все <br />
                    включено
                  </p>
                </div>
              </li>
              <li
                class="flex w-full items-center gap-[27px] md:w-[calc(50%_-_20px)] xl:w-[330px]">
                <img
                  alt=""
                  class="shrink-0"
                  src="@/assets/images/tour-icon-1.svg" />
                <div class="flex flex-col gap-[6px] text-[16px] leading-[18px]">
                  <h4
                    class="font-[700] text-[#185584] underline decoration-dotted">
                    standard room
                  </h4>
                  <p class="font-[400] text-[#777777]">2 взрослых</p>
                </div>
              </li>
              <li
                class="flex w-full items-center gap-[27px] md:w-[calc(50%_-_20px)] xl:w-[147px]">
                <img
                  alt=""
                  class="shrink-0"
                  src="@/assets/images/tour-icon-4.svg" />
                <div class="flex flex-col gap-[6px] text-[16px] leading-[18px]">
                  <h4 class="font-[700]">3 июня</h4>
                  <p class="font-[400] text-[#777777]">6 ночей</p>
                </div>
              </li>
              <li
                class="flex w-full items-center gap-[27px] md:w-[calc(50%_-_20px)] xl:w-[360px]">
                <img
                  alt=""
                  class="shrink-0"
                  src="@/assets/images/tour-icon-5.svg" />
                <div class="flex flex-col gap-[6px] text-[16px] leading-[18px]">
                  <p class="font-[400] text-[#777777]">
                    Almaty Antalya (Sunday Airlines) PROMO
                  </p>
                </div>
              </li>
              <li
                class="flex w-full items-center gap-[27px] md:w-[calc(50%_-_20px)] xl:w-[330px]">
                <img
                  alt=""
                  class="shrink-0"
                  src="@/assets/images/tour-icon-6.svg" />
                <div class="flex flex-col gap-[6px] text-[16px] leading-[18px]">
                  <h4 class="font-[700]">Услуги</h4>
                  <p class="font-[400] text-[#777777]">
                    Медицинская страховка, трансфер
                  </p>
                </div>
              </li>
            </ul>
            <ul
              class="font-open-sans mb-[9px] max-w-full border border-x-0 border-dashed border-[#DDDDDD] lg:max-w-[714px]">
              <li
                class="item-center flex flex-col justify-between gap-[10px] border-b border-dashed border-b-[#DDDDDD] py-[10px] sm:flex-row sm:gap-0 md:justify-start">
                <div class="flex items-center gap-[13px]">
                  <svg
                    class="shrink-0"
                    fill="none"
                    height="14"
                    viewBox="0 0 15 14"
                    width="15"
                    xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M3.93872 13.5924C3.93872 13.5924 4.02661 13.3043 4.20239 12.7281C4.38794 12.1422 4.58813 11.5001 4.80298 10.8019C5.01782 10.1036 5.21313 9.46643 5.38892 8.89026C5.57446 8.30432 5.66724 8.01135 5.66724 8.01135C5.66724 8.01135 5.5354 8.01135 5.27173 8.01135C5.00806 8.01135 4.71997 8.01135 4.40747 8.01135C4.09497 8.01135 3.80688 8.01135 3.54321 8.01135C3.27954 8.01135 3.14771 8.01135 3.14771 8.01135C3.14771 8.01135 2.88647 8.24329 2.36401 8.70715C1.84155 9.17102 1.58032 9.40295 1.58032 9.40295C1.58032 9.40295 1.34839 9.40295 0.884521 9.40295C0.420654 9.40295 0.188721 9.40295 0.188721 9.40295C0.188721 9.40295 0.247314 9.28088 0.364502 9.03674C0.481689 8.7926 0.611084 8.52161 0.752686 8.22375C0.894287 7.9259 1.02368 7.65002 1.14087 7.39612C1.25806 7.15198 1.31665 7.02991 1.31665 7.02991C1.31665 7.02991 1.25806 6.90784 1.14087 6.6637C1.02368 6.40979 0.894287 6.13391 0.752686 5.83606C0.611084 5.53821 0.481689 5.26721 0.364502 5.02307C0.247314 4.77893 0.188721 4.65686 0.188721 4.65686C0.188721 4.65686 0.420654 4.65686 0.884521 4.65686C1.34839 4.65686 1.58032 4.65686 1.58032 4.65686C1.58032 4.65686 1.84155 4.88879 2.36401 5.35266C2.88647 5.81653 3.14771 6.04846 3.14771 6.04846C3.14771 6.04846 3.27954 6.04846 3.54321 6.04846C3.80688 6.04846 4.09497 6.04846 4.40747 6.04846C4.71997 6.04846 5.00806 6.04846 5.27173 6.04846C5.5354 6.04846 5.66724 6.04846 5.66724 6.04846C5.66724 6.04846 5.57446 5.75549 5.38892 5.16956C5.21313 4.59338 5.01782 3.95618 4.80298 3.25793C4.58813 2.55969 4.38794 1.92249 4.20239 1.34631C4.02661 0.760376 3.93872 0.467407 3.93872 0.467407C3.93872 0.467407 4.17065 0.467407 4.63452 0.467407C5.09839 0.467407 5.33032 0.467407 5.33032 0.467407C5.33032 0.467407 5.49146 0.760376 5.81372 1.34631C6.14575 1.92249 6.50464 2.55969 6.89038 3.25793C7.27612 3.95618 7.63501 4.59338 7.96704 5.16956C8.28931 5.75549 8.45044 6.04846 8.45044 6.04846C8.45044 6.04846 8.63599 6.04846 9.00708 6.04846C9.38794 6.04846 9.80298 6.04846 10.2522 6.04846C10.7014 6.04846 11.1165 6.04846 11.4973 6.04846C11.8684 6.04846 12.054 6.04846 12.054 6.04846C12.054 6.04846 12.0906 6.04846 12.1638 6.04846C12.2371 6.04846 12.2737 6.04846 12.2737 6.04846C12.2737 6.04846 12.3152 6.05334 12.3982 6.06311C12.4812 6.07288 12.6057 6.08752 12.7717 6.10706C12.9475 6.12659 13.0916 6.151 13.2039 6.1803C13.3162 6.20959 13.3918 6.23889 13.4309 6.26819C13.47 6.29749 13.531 6.33655 13.614 6.38538C13.697 6.4342 13.7971 6.4928 13.9143 6.56116C14.0413 6.61975 14.1243 6.68811 14.1633 6.76624C14.2024 6.84436 14.1926 6.93225 14.134 7.02991C14.134 7.17639 14.0925 7.30579 14.0095 7.41809C13.9265 7.5304 13.7971 7.63049 13.6213 7.71838C13.4456 7.79651 13.2722 7.85754 13.1013 7.90149C12.9304 7.94543 12.7571 7.97229 12.5813 7.98206C12.5813 7.98206 12.4934 7.98694 12.3176 7.9967C12.1418 8.00647 12.054 8.01135 12.054 8.01135C12.054 8.01135 11.8684 8.01135 11.4973 8.01135C11.1165 8.01135 10.7014 8.01135 10.2522 8.01135C9.80298 8.01135 9.39282 8.01135 9.02173 8.01135C8.64087 8.01135 8.45044 8.01135 8.45044 8.01135C8.45044 8.01135 8.28931 8.30432 7.96704 8.89026C7.64478 9.46643 7.28833 10.1036 6.89771 10.8019C6.50708 11.5001 6.14575 12.1422 5.81372 12.7281C5.49146 13.3043 5.33032 13.5924 5.33032 13.5924C5.33032 13.5924 5.09839 13.5924 4.63452 13.5924C4.17065 13.5924 3.93872 13.5924 3.93872 13.5924Z"
                      fill="#5C6672" />
                  </svg>
                  <div class="flex flex-col text-[13px]">
                    <span class="font-[600] text-[#333333]">10:00 - 13:30</span>
                    <span class="font-[400] text-[#5C6672]">3 июн</span>
                  </div>
                </div>
                <p
                  class="flex flex-col font-[400] md:me-[80px] md:ms-[80px] lg:ms-[159px] xl:me-[130px]">
                  <span class="text-[13px] leading-[18px]"
                    >Алматы - Анталия</span
                  >
                  <span class="text-[10px] leading-[20px]"
                    >6 ч 30 м, Прямой</span
                  >
                </p>
                <p class="flex flex-col font-[400]">
                  <span class="text-[13px] leading-[18px]"
                    >Sunday Airlines</span
                  >
                  <span class="text-[10px] leading-[20px]">Чартер</span>
                </p>
              </li>
              <li
                class="item-center flex flex-col justify-between gap-[10px] py-[10px] sm:flex-row sm:gap-0 md:justify-start">
                <div class="flex items-center gap-[13px]">
                  <svg
                    class="shrink-0"
                    fill="none"
                    height="14"
                    viewBox="0 0 15 14"
                    width="15"
                    xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M10.5012 0.46936C10.5012 0.46936 10.4133 0.757585 10.2375 1.33403C10.052 1.92025 9.85181 2.56265 9.63696 3.26123C9.42212 3.9598 9.22681 4.59732 9.05103 5.17377C8.86548 5.75998 8.77271 6.05309 8.77271 6.05309C8.77271 6.05309 8.90454 6.05309 9.16821 6.05309C9.43188 6.05309 9.71997 6.05309 10.0325 6.05309C10.345 6.05309 10.6331 6.05309 10.8967 6.05309C11.1604 6.05309 11.2922 6.05309 11.2922 6.05309C11.2922 6.05309 11.5535 5.82105 12.0759 5.35696C12.5984 4.89287 12.8596 4.66082 12.8596 4.66082C12.8596 4.66082 13.0916 4.66082 13.5554 4.66082C14.0193 4.66082 14.2512 4.66082 14.2512 4.66082C14.2512 4.66082 14.1926 4.78295 14.0754 5.02721C13.9583 5.27147 13.8289 5.54259 13.6873 5.84059C13.5457 6.13858 13.4163 6.41459 13.2991 6.66862C13.1819 6.91288 13.1233 7.03501 13.1233 7.03501C13.1233 7.03501 13.1819 7.15714 13.2991 7.4014C13.4163 7.65542 13.5457 7.93144 13.6873 8.22943C13.8289 8.52742 13.9583 8.79855 14.0754 9.04281C14.1926 9.28707 14.2512 9.40919 14.2512 9.40919C14.2512 9.40919 14.0193 9.40919 13.5554 9.40919C13.0916 9.40919 12.8596 9.40919 12.8596 9.40919C12.8596 9.40919 12.5984 9.17715 12.0759 8.71306C11.5535 8.24897 11.2922 8.01693 11.2922 8.01693C11.2922 8.01693 11.1604 8.01693 10.8967 8.01693C10.6331 8.01693 10.345 8.01693 10.0325 8.01693C9.71997 8.01693 9.43188 8.01693 9.16821 8.01693C8.90454 8.01693 8.77271 8.01693 8.77271 8.01693C8.77271 8.01693 8.86548 8.31003 9.05103 8.89625C9.22681 9.4727 9.42212 10.1102 9.63696 10.8088C9.85181 11.5074 10.052 12.1449 10.2375 12.7213C10.4133 13.3075 10.5012 13.6007 10.5012 13.6007C10.5012 13.6007 10.2693 13.6007 9.80542 13.6007C9.34155 13.6007 9.10962 13.6007 9.10962 13.6007C9.10962 13.6007 8.94849 13.3075 8.62622 12.7213C8.29419 12.1449 7.9353 11.5074 7.54956 10.8088C7.16382 10.1102 6.80493 9.4727 6.4729 8.89625C6.15063 8.31003 5.9895 8.01693 5.9895 8.01693C5.9895 8.01693 5.80396 8.01693 5.43286 8.01693C5.052 8.01693 4.63696 8.01693 4.18774 8.01693C3.73853 8.01693 3.32349 8.01693 2.94263 8.01693C2.57153 8.01693 2.38599 8.01693 2.38599 8.01693C2.38599 8.01693 2.34937 8.01693 2.27612 8.01693C2.20288 8.01693 2.16626 8.01693 2.16626 8.01693C2.16626 8.01693 2.12476 8.01204 2.04175 8.00227C1.95874 7.9925 1.83423 7.97784 1.66821 7.9583C1.49243 7.93876 1.34839 7.91434 1.23608 7.88503C1.12378 7.85572 1.0481 7.8264 1.00903 7.79709C0.969971 7.76778 0.908936 7.7287 0.825928 7.67985C0.74292 7.631 0.642822 7.57238 0.525635 7.50398C0.398682 7.44536 0.315674 7.37697 0.276611 7.29881C0.237549 7.22064 0.247314 7.13271 0.305908 7.03501C0.305908 6.88845 0.347412 6.759 0.43042 6.64664C0.513428 6.53428 0.642822 6.43413 0.818604 6.3462C0.994385 6.26804 1.16772 6.20698 1.33862 6.16301C1.50952 6.11904 1.68286 6.09217 1.85864 6.0824C1.85864 6.0824 1.94653 6.07752 2.12231 6.06775C2.2981 6.05798 2.38599 6.05309 2.38599 6.05309C2.38599 6.05309 2.57153 6.05309 2.94263 6.05309C3.32349 6.05309 3.73853 6.05309 4.18774 6.05309C4.63696 6.05309 5.04712 6.05309 5.41821 6.05309C5.79907 6.05309 5.9895 6.05309 5.9895 6.05309C5.9895 6.05309 6.15063 5.75998 6.4729 5.17377C6.79517 4.59732 7.15161 3.9598 7.54224 3.26123C7.93286 2.56265 8.29419 1.92025 8.62622 1.33403C8.94849 0.757585 9.10962 0.46936 9.10962 0.46936C9.10962 0.46936 9.34155 0.46936 9.80542 0.46936C10.2693 0.46936 10.5012 0.46936 10.5012 0.46936Z"
                      fill="#5C6672" />
                  </svg>
                  <div class="flex flex-col text-[13px]">
                    <span class="font-[600] text-[#333333]">13:00 - 20:00</span>
                    <span class="font-[400] text-[#5C6672]">9 июн</span>
                  </div>
                </div>
                <p
                  class="flex flex-col font-[400] md:me-[80px] md:ms-[80px] lg:ms-[159px] xl:me-[130px]">
                  <span class="text-[13px] leading-[18px]"
                    >Алматы - Анталия</span
                  >
                  <span class="text-[10px] leading-[20px]">4 ч, Прямой</span>
                </p>
                <p class="flex flex-col font-[400]">
                  <span class="text-[13px] leading-[18px]"
                    >Sunday Airlines</span
                  >
                  <span class="text-[10px] leading-[20px]">Чартер</span>
                </p>
              </li>
            </ul>
            <div class="flex justify-center">
              <button class="flex items-center gap-[2px]">
                <span
                  class="font-open-sans border-b border-dashed border-b-[#185584] text-[10px] font-[600] uppercase leading-[14px]"
                  >Выбрать другие рейсы</span
                >
                <svg
                  fill="none"
                  height="7"
                  viewBox="0 0 12 7"
                  width="12"
                  xmlns="http://www.w3.org/2000/svg">
                  <path
                    d="M1.47021 0.875C1.47021 0.875 1.70068 1.09766 2.16162 1.54297C2.62256 1.98828 3.13037 2.48047 3.68506 3.01953C4.23975 3.55859 4.74756 4.05078 5.2085 4.49609C5.66943 4.94141 5.8999 5.16406 5.8999 5.16406C5.8999 5.16406 6.13037 4.94141 6.59131 4.49609C7.06006 4.05078 7.57178 3.55859 8.12646 3.01953C8.68115 2.48047 9.19287 1.98828 9.66162 1.54297C10.1226 1.09766 10.353 0.875 10.353 0.875C10.4468 0.773438 10.5405 0.722656 10.6343 0.722656C10.728 0.722656 10.8296 0.773438 10.939 0.875C11.0405 0.96875 11.0913 1.0625 11.0913 1.15625C11.0913 1.25 11.0405 1.35156 10.939 1.46094C10.939 1.46094 10.6929 1.70703 10.2007 2.19922C9.70068 2.69141 9.15381 3.23047 8.56006 3.81641C7.96631 4.40234 7.41943 4.94141 6.91943 5.43359C6.42725 5.92578 6.18115 6.17188 6.18115 6.17188C6.10303 6.25 6.01709 6.28906 5.92334 6.28906C5.82959 6.28906 5.72803 6.25 5.61865 6.17188C5.61865 6.17188 5.37256 5.92578 4.88037 5.43359C4.38037 4.94141 3.8335 4.40234 3.23975 3.81641C2.646 3.23047 2.09912 2.69141 1.59912 2.19922C1.10693 1.70703 0.86084 1.46094 0.86084 1.46094C0.759277 1.35938 0.708496 1.25977 0.708496 1.16211C0.708496 1.06445 0.759277 0.96875 0.86084 0.875C0.95459 0.78125 1.05225 0.734375 1.15381 0.734375C1.25537 0.734375 1.36084 0.78125 1.47021 0.875Z"
                    fill="#185584" />
                </svg>
              </button>
            </div>
          </div>
          <div
            class="flex w-full flex-shrink-0 flex-col justify-end gap-[20px] bg-[#F2F2F2] px-[18px] py-[24px] lg:w-[283px]">
            <div
              class="font-open-sans flex w-full items-center justify-center gap-[12px]">
              <span
                class="text-[32px] font-extrabold leading-[25px] text-[#333333]"
                >435 609</span
              >
              <div class="flex flex-col gap-[1px]">
                <span class="text-[10px] font-normal leading-[10px]">ТНГ</span>
                <span class="text-[10px] font-normal leading-[10px]"
                  >за номер</span
                >
              </div>
            </div>
            <button
              class="wfull flex h-[44px] items-center justify-center rounded-[4px] bg-[#5CB85C] text-[16px] font-semibold leading-[18px] text-white">
              Заявка на тур
            </button>
          </div>
        </div>
      </div>
      <div class="mb-[25px] mt-[36px] flex items-center gap-[28px] ps-[16px]">
        <button
          class="border-b border-solid border-b-[#1EC0CA] text-[16px] uppercase text-[#1EC0CA]">
          Отель
        </button>
        <button class="text-[16px] uppercase text-[#5C6672]">Отзывы</button>
      </div>
      <div class="flex flex-col items-start gap-[22px] xl:flex-row">
        <div
          class="relative w-full shrink-0 overflow-hidden rounded-[10px] xl:w-[761px]">
          <div class="swiper">
            <div class="swiper-wrapper">
              <div v-for="i in 36" :key="i" class="swiper-slide">
                <img
                  alt=""
                  class="h-[478px] w-full rounded-[5px] object-cover"
                  src="@/assets/images/slide-card-1.png" />
              </div>
            </div>
          </div>
          <button
            class="absolute left-[7px] top-[50%] z-[2] -translate-y-[50%]"
            @click="swp.slidePrev()">
            <img alt="" src="@/assets/images/slider-btn-prev.svg" />
          </button>
          <button
            class="absolute right-[7px] top-[50%] z-[2] -translate-y-[50%]"
            @click="swp.slideNext()">
            <img alt="" src="@/assets/images/slider-btn-next.svg" />
          </button>
          <div
            class="swpFraction font-open-sans absolute bottom-0 right-0 z-[2] bg-[rgba(0,0,0,0.64)] p-[5px] text-[13px] leading-[18px] text-white">
            1/37
          </div>
        </div>
        <div class="w-full">
          <h3
            class="max-w-full text-[26px] font-[600] leading-[32px] text-[#000000] xl:max-w-[467px]">
            senza garden holiday club (ex. larissa hill beach) 5*
          </h3>
          <div class="my-[9px] flex items-center gap-[3px]">
            <svg
              v-for="i in 5"
              :key="i"
              fill="none"
              height="13"
              viewBox="0 0 14 13"
              width="14"
              xmlns="http://www.w3.org/2000/svg">
              <path
                d="M13.5078 5.33044C13.5078 5.38513 13.4896 5.44438 13.4531 5.50818C13.4167 5.57198 13.362 5.64034 13.2891 5.71326L10.4727 8.47498L11.1289 12.3851C11.1289 12.3942 11.1289 12.4125 11.1289 12.4398C11.1289 12.4672 11.1289 12.4945 11.1289 12.5219C11.1289 12.5765 11.1221 12.6289 11.1084 12.6791C11.0947 12.7292 11.0742 12.7679 11.0469 12.7953C11.0195 12.8317 10.9899 12.8636 10.958 12.891C10.9261 12.9183 10.8828 12.932 10.8281 12.932C10.7734 12.932 10.7188 12.9206 10.6641 12.8978C10.6094 12.875 10.5547 12.85 10.5 12.8226L7 10.9906L3.5 12.8226C3.44531 12.85 3.39062 12.875 3.33594 12.8978C3.28125 12.9206 3.22656 12.932 3.17188 12.932C3.11719 12.932 3.06934 12.9206 3.02832 12.8978C2.9873 12.875 2.95312 12.8409 2.92578 12.7953C2.89844 12.7679 2.87793 12.7292 2.86426 12.6791C2.85059 12.6289 2.84375 12.5765 2.84375 12.5219C2.84375 12.5127 2.84375 12.4945 2.84375 12.4672C2.84375 12.4398 2.85286 12.4125 2.87109 12.3851L3.52734 8.47498L0.683594 5.71326C0.628906 5.63123 0.583333 5.56059 0.546875 5.50134C0.510417 5.4421 0.492188 5.38513 0.492188 5.33044C0.492188 5.2393 0.530924 5.16182 0.608398 5.09802C0.685872 5.03422 0.792969 4.9932 0.929688 4.97498L4.86719 4.40076L6.61719 0.846069C6.67188 0.736694 6.72884 0.654663 6.78809 0.599976C6.84733 0.545288 6.91797 0.517944 7 0.517944C7.08203 0.517944 7.15267 0.545288 7.21191 0.599976C7.27116 0.654663 7.32812 0.736694 7.38281 0.846069L9.13281 4.40076L13.0703 4.97498C13.207 4.98409 13.3141 5.02055 13.3916 5.08435C13.4691 5.14815 13.5078 5.23018 13.5078 5.33044Z"
                fill="#FFCC00" />
            </svg>
          </div>
          <p
            class="mb-[47px] text-[14px] font-[400] leading-[18px] text-[#5C6672]">
            Турция, Аланья
          </p>
          <h4
            class="mb-[13px] text-[20px] font-[700] leading-[24px] text-black">
            ОБЩАЯ ИНФОРМАЦИЯ
          </h4>
          <ul
            class="flex flex-col gap-[9px] text-[16px] font-[400] leading-[24px] text-[#5C6672]">
            <li>
              <span class="font-[700] text-[#333333]">Основан:</span> 1990
            </li>
            <li>
              <span class="font-[700] text-[#333333]"
                >Последняя реставрация:</span
              >
              2020
            </li>
            <li>
              <span class="font-[700] text-[#333333]">Расположение:</span> 115
              км от аэропорта г. Анталия, 8 км от г. Алания
            </li>
            <li>
              <span class="font-[700] text-[#333333]">Площадь:</span> 220 000 кв
              м
            </li>
            <li>
              <span class="font-[700] text-[#333333]">Телефон:</span> +90
              2427450596
            </li>
            <li>
              <span class="font-[700] text-[#333333]">Сайт:</span>
              https://gardenholidayclub.senzahotels.com
            </li>
            <li>
              <span class="font-[700] text-[#333333]">Адрес:</span> D-400
              Karayolu Bolge Trafik Amirligi Karsisi Konakli / Alanya / Antalya
              / Turkiye
            </li>
          </ul>
        </div>
      </div>
      <p class="my-[32px] text-[16px] leading-[24px] text-[#5C6672]">
        Отель с просторной зеленой территорией в поселке Конаклы. Большая часть
        номеров расположена в корпусах на холме. Богатый выбор развлечений как
        для взрослых, так и для маленьких гостей. Подходит для спокойного
        семейного отдыха.
      </p>
      <ul class="flex max-w-full flex-col xl:max-w-[994px] xl:ps-[14px]">
        <li
          v-for="(item, i) in skills"
          :key="i"
          class="flex flex-col items-start border-t border-solid border-t-[#DDDDDD] pb-[15px] pt-[10px] sm:flex-row">
          <h3
            class="font-roboto w-[213px] shrink-0 ps-[13px] text-[16px] font-[600] leading-[25px] text-black">
            {{ item.title }}
          </h3>
          <ul class="w-full pt-[10px]">
            <li
              v-for="(list, idx) in item.list"
              :key="idx"
              class="flex items-start gap-[7px]">
              <img
                alt=""
                class="shrink-0 translate-y-[10px]"
                src="@/assets/images/check.svg" />
              <p
                class="font-open-sans text-[14px] leading-[21px] text-[#5C6672]">
                {{ list }}
              </p>
            </li>
          </ul>
        </li>
      </ul>
    </div>
  </Container>
</template>
